In [1]:
import numpy as np
import pandas as pd
import json
import os

In [2]:
# Combine these two tables 
ori = pd.read_csv('fromjson_photos.csv')
photos = pd.read_csv('fromcsv_photos.csv')

# Combine these two
toy = pd.read_csv('fromcsv_toy.csv')
toy_coord = pd.read_csv('fromjson_toyCoord.csv')

# Work with these three
unknown = pd.read_csv('fromcsv_unknown.csv')
mon = pd.read_csv('fromcsv_monkey.csv')
mon_coord = pd.read_csv('fromjson_mCoord.csv')

In [3]:
photos['orientation'] = ori['orientation']
photos['contents'] = 'monkey'
display(photos.tail())
photos.to_csv('photos_FINAL.csv', index=False)
print("PHOTOS TABLE IS SAVED!")

,jpg_id,file_name,sd_card,date_taken,monkey_group,orientation,contents
6746,6746,20220825_SD05_6957.JPG,SD05,2022-08-25,Instigators,portait,monkey
6747,6747,20220825_SD05_6958.JPG,SD05,2022-08-25,Instigators,portait,monkey
6748,6748,20220825_SD05_6960.JPG,SD05,2022-08-25,Instigators,portait,monkey
6749,6749,20220825_SD05_6963.JPG,SD05,2022-08-25,Instigators,portait,monkey
6750,6750,20220825_SD05_6967.JPG,SD05,2022-08-25,Instigators,portait,monkey

PHOTOS TABLE IS SAVED!

# Toy Table

In [4]:
toy_coord.head(15)

    jpg_id         toy                                        coordinates
0       34     Unknown                      (0.0, 0.895628, 0.16083, 1.0)
1       38     Unknown  (0.7477809999999999, 0.818182, 1.0, 0.97861000...
2       60  DentalStar  (0.6565219999999999, 0.727354, 0.947826, 0.825...
3       80    Dumbbell                     (0.321212, 0.748602, 1.0, 1.0)
4      163     Grenade  (0.40405599999999997, 0.365112, 0.528861, 0.61...
5      163     Grenade           (0.177847, 0.161492, 0.312012, 0.327664)
6      164     Grenade  (0.212168, 0.187237, 0.34165399999999996, 0.36...
7      164     Grenade  (0.430577, 0.404899, 0.5538219999999999, 0.608...
8      165     Grenade           (0.182527, 0.112342, 0.327613, 0.292557)
9      165     Grenade  (0.338534, 0.500858, 0.46021799999999996, 0.68...
10     166     Grenade  (0.46645899999999996, 0.318302, 0.588144, 0.51...
11     166     Grenade  (0.232449, 0.10064000000000001, 0.380654999999...
12     176        Kong  (0.27761, 0.512299, 0.49905499999999997, 0.652...
13     177        Kong  (0.15084, 0.43957199999999996, 0.4140069999999...
14     178        Kong  (0.186143, 0.39893, 0.46535699999999997, 0.539...

In [5]:
toy.head(15)

    jpg_id         toy
0       38     Unknown
1       60  DentalStar
2       79    Dumbbell
3      163     Grenade
4      163     Grenade
5      164     Grenade
6      164     Grenade
7      165     Grenade
8      165     Grenade
9      166     Grenade
10     166     Grenade
11     176        Kong
12     177        Kong
13     178        Kong
14     179        Kong

In [6]:
toy_merged = pd.merge(toy, toy_coord, on = ['jpg_id','toy'], how = 'outer')
toy_merged = toy_merged.sort_values('jpg_id', ignore_index = True)
toy_merged = toy_merged.reset_index().rename(columns={'index': 'toy_id'})
display(toy_merged.head())

# Just out of curiosity, check how many NaNs are there
toy_merged['coordinates'].isna().sum()

,toy_id,jpg_id,toy,coordinates
0,0,34,Unknown,"(0.0, 0.895628, 0.16083, 1.0)"
1,1,38,Unknown,"(0.7477809999999999, 0.818182, 1.0, 0.97861000..."
2,2,60,DentalStar,"(0.6565219999999999, 0.727354, 0.947826, 0.825..."
3,3,79,Dumbbell,NaN
4,4,80,Dumbbell,"(0.321212, 0.748602, 1.0, 1.0)"

16

In [7]:
toy_merged.to_csv('toys_FINAL.csv', index=False)
print("TOYS TABLE IS SAVED!")

TOYS TABLE IS SAVED!

# Monkey

In [8]:
mon_coord.head(10)

,jpg_id,coordinates,monkey_name,body_part
0,0,"(0.36186799999999997, 0.0028209999999999997, 0...",DF2I,Face
1,0,"(0.0, 0.0, 0.954399, 1.0)",DF2I,Body
2,1,"(0.34282199999999996, 0.0, 0.8845649999999999,...",DF2I,Face
3,1,"(0.0, 0.0028209999999999997, 0.975560999999999...",DF2I,Body
4,2,"(0.002116, 0.0, 0.387262, 0.7334269999999999)",7124,Body
5,2,"(0.101577, 0.09591000000000001, 0.971329, 1.0)",110E,Body
6,2,"(0.0, 0.0, 0.378797, 0.31029599999999996)",7124,Face
7,2,"(0.126971, 0.35543, 0.8591709999999999, 0.943583)",151J,Body
8,2,"(0.152365, 0.35543, 0.5100009999999999, 0.558533)",151J,Face
9,2,"(0.118506, 0.094499, 0.5100009999999999, 0.389...",110E,Face

In [9]:
mon = mon.rename(columns={'monkey_names':'monkey_name'})
mon.head(10)

   jpg_id monkey_name
0       0        DF2I
1       1        DF2I
2       2        7124
3       2        110E
4       2        151J
5       3        7124
6       3        110E
7       3        151J
8       4        7124
9       4        110E

In [10]:
mon_merged = pd.merge(mon, mon_coord, on=['jpg_id','monkey_name'], how = 'outer')
mon_merged = mon_merged.sort_values(by = ['jpg_id', 'monkey_name'], ignore_index = True)
mon_merged.head(20)

,jpg_id,monkey_name,coordinates,body_part
0,0,DF2I,"(0.36186799999999997, 0.0028209999999999997, 0...",Face
1,0,DF2I,"(0.0, 0.0, 0.954399, 1.0)",Body
2,1,DF2I,"(0.34282199999999996, 0.0, 0.8845649999999999,...",Face
3,1,DF2I,"(0.0, 0.0028209999999999997, 0.975560999999999...",Body
4,2,110E,"(0.101577, 0.09591000000000001, 0.971329, 1.0)",Body
5,2,110E,"(0.118506, 0.094499, 0.5100009999999999, 0.389...",Face
6,2,151J,"(0.126971, 0.35543, 0.8591709999999999, 0.943583)",Body
7,2,151J,"(0.152365, 0.35543, 0.5100009999999999, 0.558533)",Face
8,2,7124,"(0.002116, 0.0, 0.387262, 0.7334269999999999)",Body
9,2,7124,"(0.0, 0.0, 0.378797, 0.31029599999999996)",Face
10,3,110E,"(0.408894, 0.20014, 0.652928, 0.6150639999999999)",Face
11,3,110E,"(0.40347099999999997, 0.195258, 0.936009, 1.0)",Body
12,3,151J,"(0.42407799999999995, 0.587402, 0.616051999999...",Face
13,3,151J,"(0.41214799999999996, 0.584148, 0.854664, 1.0)",Body
14,3,7124,"(0.130152, 0.016272, 0.394794, 0.5239429999999...",Face
15,3,7124,"(0.12364399999999999, 0.014643999999999999, 0....",Body
16,4,110E,"(0.37635599999999997, 0.167597, 0.978308, 0.99...",Body
17,4,110E,"(0.736443, 0.16597, 0.978308, 0.624826)",Face
18,4,151J,"(0.276573, 0.5564859999999999, 0.685466, 1.0)",Body
19,4,151J,"(0.47397000000000006, 0.564622, 0.681128, 0.87...",Face

In [11]:
mon_merged['coordinates'].isna().sum()

727

In [12]:
mon_merged.to_csv('mon_needsManualProcessing.csv', index=False)
print("MONKEYS TABLE IS SAVED!")

MONKEYS TABLE IS SAVED!

In [13]:
unknown

     jpg_id monkey_names unknown_guess
0        50     Unknown1            NN
1        60     Unknown1             I
2        60     Unknown2            NN
3        64     Unknown1      Juvenile
4        64     Unknown2            NN
..      ...          ...           ...
660    6738     Unknown1             K
661    6739     Unknown1             K
662    6740     Unknown1             K
663    6741     Unknown1             K
664    6742     Unknown1             K

[665 rows x 3 columns]